       IDENTIFICATION DIVISION.
       PROGRAM-ID. 'ZTPHELLO'.

      ******************************************************************
      * Broadcom Test4z Tutorial.                                      *
      * Copyright (c) 2024 Broadcom. All Rights Reserved.              *
      *                                                                *
      * See ZTTHELLO and tutorial instructions for details.            *
      ******************************************************************

       DATA DIVISION.
       PROCEDURE DIVISION.

           DISPLAY 'ZTPHELLO says hello!'
           GOBACK.
           