       IDENTIFICATION DIVISION.
       PROGRAM-ID. ZTPPARAT.

      ******************************************************************
      * Broadcom Test4z Unit Test Suite (UT) example.                  *
      * Copyright (c) 2024 Broadcom. All Rights Reserved.              *
      *                                                                *
      * This unit test example has been replaced by ZTPWATCH/ZTTSECTN. *
      ******************************************************************

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY ZTESTWS.
       LINKAGE SECTION.

       PROCEDURE DIVISION.

           DISPLAY 'ZTPPARAT this example replaced by ZTPWATCH'

           GOBACK.
    